// import 'package:flutter/material.dart';
// import 'package:flutter/widgets.dart';
// import 'package:app/module/date_base.dart';

class cars {
  int id;
  String name;
  String complect;
  String pathPhoto;
  double price;
  String discription;
  cars(this.id, this.name, this.complect, this.discription, this.pathPhoto,
      this.price);
}

List<cars> catalog_cars = [
  cars(
      1,
      "LADA GRANTA СЕДАН",
      "Standart",
      "Современный, рациональный, комфортный. Седан со вместительным багажником, который гармонично вписан в стремительную форму кузова. Как тот самый костюм, который подходит к любой фигуре. Как фильм, который видели все: всегда интересный и по-новому актуальный.",
      "lib/image/LADA GRANTA СЕДАН Standart.png",
      699000),
  cars(
      2,
      "LADA GRANTA СЕДАН",
      "Classic",
      "Современный, рациональный, комфортный. Седан со вместительным багажником, который гармонично вписан в стремительную форму кузова. Как тот самый костюм, который подходит к любой фигуре. Как фильм, который видели все: всегда интересный и по-новому актуальный.",
      "lib/image/LADA GRANTA СЕДАН Classic.png",
      799000),
  cars(
      3,
      "LADA GRANTA СЕДАН",
      "Comfort",
      "Современный, рациональный, комфортный. Седан со вместительным багажником, который гармонично вписан в стремительную форму кузова. Как тот самый костюм, который подходит к любой фигуре. Как фильм, который видели все: всегда интересный и по-новому актуальный.",
      "lib/image/LADA GRANTA СЕДАН Comfort.png",
      959000),
  cars(
      4,
      "LADA GRANTA СЕДАН",
      "Classic'23 Кондиционер",
      "Современный, рациональный, комфортный. Седан со вместительным багажником, который гармонично вписан в стремительную форму кузова. Как тот самый костюм, который подходит к любой фигуре. Как фильм, который видели все: всегда интересный и по-новому актуальный.",
      "lib/image/LADA GRANTA СЕДАН Classic'23 Кондиционер.png",
      1959000),
  cars(
      5,
      "LADA GRANTA СЕДАН",
      "CLUB'23",
      "Современный, рациональный, комфортный. Седан со вместительным багажником, который гармонично вписан в стремительную форму кузова. Как тот самый костюм, который подходит к любой фигуре. Как фильм, который видели все: всегда интересный и по-новому актуальный.",
      "lib/image/LADA GRANTA СЕДАН Comfort.png",
      999000),
  cars(
      6,
      "LADA VESTA СЕДАН",
      "Comfort",
      "Энергичный дизайн LADA Vesta новое поколение стал еще привлекательней. Развитый рельеф бамперов создает современный и динамичный образ автомобиля, а новая светодиодная оптика делает его по-настоящему заметным.",
      "lib/image/LADA VESTA СЕДАН Comfort.png",
      1999000),
  cars(
      7,
      "LADA VESTA СЕДАН",
      "Life",
      "Энергичный дизайн LADA Vesta новое поколение стал еще привлекательней. Развитый рельеф бамперов создает современный и динамичный образ автомобиля, а новая светодиодная оптика делает его по-настоящему заметным.",
      "lib/image/LADA VESTA СЕДАН Life.png",
      2090000),
  cars(
      8,
      "LADA VESTA СЕДАН",
      "Enjoy",
      "Энергичный дизайн LADA Vesta новое поколение стал еще привлекательней. Развитый рельеф бамперов создает современный и динамичный образ автомобиля, а новая светодиодная оптика делает его по-настоящему заметным.",
      "lib/image/LADA VESTA СЕДАН Enjoy.png",
      3890000),
];
